BasileBerckmoes/RobotComp2ELO/Roadster/Software/PSoc/Roadster/RoadsterRACEMODE/CyComponentLibrary.cylib/CapSense_v1_0/API/CapSense_SensingCSX_LL.h
/***************************************************************************//**
* \file `$INSTANCE_NAME`_SensingCSX_LL.h
* \version `$CY_MAJOR_VERSION`.`$CY_MINOR_VERSION`
*
* \brief
*   This file provides the headers of APIs specific to CSX sensing implementation.
*
* \see CapSense v`$CY_MAJOR_VERSION`.`$CY_MINOR_VERSION` Datasheet
*
*//*****************************************************************************
* Copyright (2016-2017), Cypress Semiconductor Corporation.
********************************************************************************
* This software is owned by Cypress Semiconductor Corporation (Cypress) and is
* protected by and subject to worldwide patent protection (United States and
* foreign), United States copyright laws and international treaty provisions.
* Cypress hereby grants to licensee a personal, non-exclusive, non-transferable
* license to copy, use, modify, create derivative works of, and compile the
* Cypress Source Code and derivative works for the sole purpose of creating
* custom software in support of licensee product to be used only in conjunction
* with a Cypress integrated circuit as specified in the applicable agreement.
* Any reproduction, modification, translation, compilation, or representation of
* this software except as specified above is prohibited without the express
* written permission of Cypress.
*
* Disclaimer: CYPRESS MAKES NO WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, WITH
* REGARD TO THIS MATERIAL, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
* WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
* Cypress reserves the right to make changes without further notice to the
* materials described herein. Cypress does not assume any liability arising out
* of the application or use of any product or circuit described herein. Cypress
* does not authorize its products for use as critical components in life-support
* systems where a malfunction or failure may reasonably be expected to result in
* significant injury to the user. The inclusion of Cypress' product in a life-
* support systems application implies that the manufacturer assumes all risk of
* such use and in doing so indemnifies Cypress against all charges. Use may be
* limited by and subject to the applicable Cypress software license agreement.
*******************************************************************************/

#if !defined(`$INSTANCE_NAME`_SENSING_CSX_LL_H)
#define `$INSTANCE_NAME`_SENSING_CSX_LL_H

#include "syslib/cy_syslib.h"
#include "`$INSTANCE_NAME`_Structure.h"
#include "`$INSTANCE_NAME`_Configuration.h"

#if (`$INSTANCE_NAME`_CSX_EN == 1u)

/*******************************************************************************
* Specific Pin Register Definition
*******************************************************************************/


/*******************************************************************************
* Register Configuration
*******************************************************************************/

/*
   +--------+---------------+--------------------------------------------+-------------------------------------------+
   |        |               | BLOCK_OFF_AFTER_SCAN=TRUE                  | BLOCK_OFF_AFTER_SCAN=FALSE                |
   +  BITS  +   FIELD       +--------------------------------------------+-------------------------------------------+
   |        |               |              MODE                          |              MODE                         |
   |--------|---------------|--------------------------------------------|-------------------------------------------|
   |  0     | IREF_SEL      | Select Iref according to IrefSel parameter | Select Iref according to IrefSel parameter|
   |  8:4   | FILTER_DELAY  | 0x02(2-SampleClk cycles)                   | 0x02(2-SampleClk cycles)                  |
   |  11:10 | SHIELD_DELAY  | 0x00(Delay Line is OFF)                    | 0x00(Delay Line is OFF)                   |
   |  12    | SENSE_EN      | 0x00(Disabled. All switches are open)      | 0x01(Enabled. Switches can be closed)     |
   |  17    | FULL_WAVE     | 0x00(Half Wave Mode)                       | 0x00(Half Wave Mode)                      |
   |  18    | MUTUAL_CAP    | 0x01(Mutual-cap mode)                      | 0x01(Mutual-cap mode)                     |
   |  19    | CSX_DUAL_CNT  | 0x01(Use two counters)                     | 0x01(Use two counters)                    |
   |  24    | DSI_COUNT_SEL | 0x00(CSD-Result on the DSI_COUNT bus)      | 0x00(CSD-Result on DSI_COUNT bus)         |
   |  25    | DSI_SAMPLE_EN | 0x00(DSI_SAMPLE_IN is disabled)            | 0x00(DSI_SAMPLE_IN is disabled)           |
   |  26    | SAMPLE_SYNC   | 0x00(Double sync is disabled)              | 0x00(Double sync is disabled)             |
   |  27    | DSI_SENSE_EN  | 0x00(DSI_SENSE_IN is disabled)             | 0x00(DSI_SENSE_IN is disabled)            |
   |  30    | LP_MODE       | 0x00(High power mode)                      | 0x00(High power mode)                     |
   |  31    | ENABLE        | 0x00(Analog part is OFF)                   | 0x01(Analog part is ON)                   |
   +--------+---------------+--------------------------------------------+-------------------------------------------+ */
#if(`$INSTANCE_NAME`_DISABLE != `$INSTANCE_NAME`_BLOCK_OFF_AFTER_SCAN_EN)
    #define `$INSTANCE_NAME`_CONFIG_DEFAULT_EN_CFG           (0x00000000uL)
#else
    #define `$INSTANCE_NAME`_CONFIG_DEFAULT_EN_CFG           (0x80001000uL)
#endif /* (`$INSTANCE_NAME`_DISABLE != `$INSTANCE_NAME`_BLOCK_OFF_AFTER_SCAN_EN) */

#if(`$INSTANCE_NAME`_IREF_SRSS != `$INSTANCE_NAME`_CSD_IREF_SOURCE)
    #define `$INSTANCE_NAME`_CONFIG_DEFAULT_IREF_CFG         (0x00000001uL)
#else
    #define `$INSTANCE_NAME`_CONFIG_DEFAULT_IREF_CFG         (0x00000000uL)
#endif /* (`$INSTANCE_NAME`_IREF_SRSS != `$INSTANCE_NAME`_CSD_IREF_SOURCE) */

#if(`$INSTANCE_NAME`_DISABLE != `$INSTANCE_NAME`_LP_MODE_EN)
    #define `$INSTANCE_NAME`_CONFIG_DEFAULT_LP_MODE_CFG      (0x40000000uL)
#else
    #define `$INSTANCE_NAME`_CONFIG_DEFAULT_LP_MODE_CFG      (0x00000000uL)
#endif /* (`$INSTANCE_NAME`_DISABLE != `$INSTANCE_NAME`_LP_MODE_EN) */

