BasileBerckmoes/RobotComp2ELO/Roadster/Software/PSoc/Roadster/RoadsterRACEMODE/CyComponentLibrary.cylib/CapSense_v1_0/API/CapSense_SensingCSX_LL.h
#define `$INSTANCE_NAME`_CONFIG_DEFAULT_FILTER_DELAY_CFG     (0x00000020uL)
#define `$INSTANCE_NAME`_CONFIG_DEFAULT_MUTUAL_CFG           (0x00040000uL)
#define `$INSTANCE_NAME`_CONFIG_DEFAULT_DUAL_CNT_CFG         (0x00080000uL)


#define `$INSTANCE_NAME`_DEFAULT_CSD_CONFIG_CFG       (`$INSTANCE_NAME`_CONFIG_DEFAULT_IREF_CFG |\
                                                       `$INSTANCE_NAME`_CONFIG_DEFAULT_FILTER_DELAY_CFG |\
                                                       `$INSTANCE_NAME`_CONFIG_DEFAULT_MUTUAL_CFG |\
                                                       `$INSTANCE_NAME`_CONFIG_DEFAULT_DUAL_CNT_CFG |\
                                                       `$INSTANCE_NAME`_CONFIG_DEFAULT_LP_MODE_CFG |\
                                                       `$INSTANCE_NAME`_CONFIG_DEFAULT_EN_CFG)


/* +--------+---------------+----------------------------------------------------------------------------------------+
   |  BITS  |   FIELD       |              MODE                                                                      |
   |--------|---------------|----------------------------------------------------------------------------------------|
   | 1      | SAMPLE        | 0x01(Clear CSD End Of Scan interrupt)                                                  |
   | 2      | INIT          | 0x01(Clear CSD End Of Coarse Init interrupt)                                           |
   | 8      | ADC_RES       | 0x01(Clear ADC End Of Scan interrupt)                                                  |
   +--------+---------------+----------------------------------------------------------------------------------------+ */
#define `$INSTANCE_NAME`_DEFAULT_CSD_INTR_CFG                   (`$INSTANCE_NAME`_CSD_INTR_ALL_MSK)

/* +--------+---------------+----------------------------------------------------------------------------------------+
   |  BITS  |   FIELD       |              MODE                                                                      |
   |--------|---------------|----------------------------------------------------------------------------------------|
   | 1      | SAMPLE        | 0x00(CSD End Of Scan interrupt is cleared)                                             |
   | 2      | INIT          | 0x00(CSD End Of Coarse Init interrupt is cleared)                                      |
   | 8      | ADC_RES       | 0x00(ADC End Of Scan interrupt is cleared)                                             |
   +--------+---------------+----------------------------------------------------------------------------------------+*/
#define `$INSTANCE_NAME`_DEFAULT_CSD_INTR_SET_CFG               (0x00000000uL)

/* +--------+---------------+----------------------------------------------------------------------------------------+
   |  BITS  |   FIELD       |              MODE                                                                      |
   |--------|---------------|----------------------------------------------------------------------------------------|
   | 1      | SAMPLE        | 0x00(CSD End Of Scan interrupt is masked)                                              |
   | 2      | INIT          | 0x00(CSD End Of Coarse Init interrupt is masked)                                       |
   | 8      | ADC_RES       | 0x00(ADC End Of Scan interrupt is masked)                                              |
   +--------+---------------+----------------------------------------------------------------------------------------+*/
#define `$INSTANCE_NAME`_DEFAULT_CSD_INTR_MASK_CFG              (`$INSTANCE_NAME`_CSD_INTR_MASK_SAMPLE_MSK)

/* +--------+---------------+----------------------------------------------------------------------------------------+
   |  BITS  |   FIELD       |              MODE                                                                      |
   |--------|---------------|----------------------------------------------------------------------------------------|
   |  0     |  HSCMP_EN     | 0x00(High Speed comparator is disabled)                                                |
   |  4     |  HSCMP_INVERT | 0x00(High Speed comparator output is not inverted)                                     |
   |  31    |  AZ_EN        | 0x00(Auto-Zero is disabled)                                                            |
   +--------+---------------+----------------------------------------------------------------------------------------+*/
#define `$INSTANCE_NAME`_DEFAULT_CSD_HSCMP_CFG                  (0x00000000uL)

 /*+--------+---------------+------------------------------------------+-------------------------------------------+
   |        |               |           VDDA >= 2V                     |          VDDA <2V                         |
   +  BITS  +   FIELD       +------------------------------------------+-------------------------------------------+
   |        |               |              MODE                        |             MODE                          |
   |--------|---------------|------------------------------------------|-------------------------------------------|
   |  1:0   | PWR_MODE      | 0x00(Amux buffer is disabled)            | 0x01(Amux buffer is at normal power level)|
   +--------+---------------+------------------------------------------+-------------------------------------------+ */
#if (`$INSTANCE_NAME`_CYDEV_VDDA_MV >= 2000u)
    #define `$INSTANCE_NAME`_DEFAULT_CSD_AMBUF_CFG              (0x00000000uL)
#else
    #define `$INSTANCE_NAME`_DEFAULT_CSD_AMBUF_CFG              (0x00000001uL)
#endif /* (CYDEV_VDDA_MV >= 2000u) */

 /*+--------+---------------+------------------------------------------+---------------------------------------------+
   |        |               |           VDDA >= 2V                     |          VDDA <2V                           |
   +  BITS  +   FIELD       +------------------------------------------+---------------------------------------------+
   |        |               |              MODE                        |             MODE                            |
   |--------|---------------|------------------------------------------|---------------------------------------------|
   |  0     | REFGEN_EN     | 0x01(Reference generator is enabled)     | 0x01(Reference generator is enabled)        |
   |  4     | BYPASS        | 0x00(BYPASS mode switch is open)         | 0x01(BYPASS mode switch is closed)          |
   |  5     | VDDA_EN       | 0x00(DDA mode switch is open)            | 0x00(VDDA mode switch is open)              |
   |  6     | RES_EN        | 0x01(Resistor string is enabled)         | 0x00(Resistor string is disabled)           |
   |  12:08 | GAIN          | 0x1F(All feedback switches are closed)   | 0x00(All feedback switches are open)        |
   |  20:16 | VREFLO_SEL    | 0x00(Open all VREFLO switches)           | 0x01(Close 1 lower VREFLO switch in the tap)|
   |  23    | VREFHI_SEL    | 0x00(Open VREF_LO_INT switch)            | 0x00(Open VREF_LO_INT switch)               |
   +--------+---------------+------------------------------------------+---------------------------------------------+ */
#if(`$INSTANCE_NAME`_VREF_SRSS != `$INSTANCE_NAME`_CSD_VREF_SOURCE)
    #define `$INSTANCE_NAME`_REFGEN_DEFAULT_GAIN_CFG    (0x00001F00uL)
#else
    #define `$INSTANCE_NAME`_REFGEN_DEFAULT_GAIN_CFG    (0x00001400uL)
#endif /* (`$INSTANCE_NAME`_VREF_SRSS != `$INSTANCE_NAME`_CSD_VREF_SOURCE) */

#if (`$INSTANCE_NAME`_CYDEV_VDDA_MV >= 2000u)
    #define `$INSTANCE_NAME`_REFGEN_DEFAULT_BYPASS_CFG  (0x00000000uL)
#else
    #define `$INSTANCE_NAME`_REFGEN_DEFAULT_BYPASS_CFG  (0x00000010uL)
#endif /* (CYDEV_VDDA_MV >= 2000u) */

#if((`$INSTANCE_NAME`_DISABLE != `$INSTANCE_NAME`_LP_MODE_EN) || (`$INSTANCE_NAME`_CYDEV_VDDA_MV < 2000u))
    #define `$INSTANCE_NAME`_REFGEN_DEFAULT_RES_EN_CFG  (0x00000000uL)
#else
    #define `$INSTANCE_NAME`_REFGEN_DEFAULT_RES_EN_CFG  (0x00000040uL)
#endif /* ((`$INSTANCE_NAME`_DISABLE != `$INSTANCE_NAME`_LP_MODE_EN) || (`$INSTANCE_NAME`_CYDEV_VDDA_MV < 2000u)) */

#define  `$INSTANCE_NAME`_REFGEN_DEFAULT_EN_CFG         (0x00000001uL)

#define `$INSTANCE_NAME`_DEFAULT_CSD_REFGEN_CFG         (`$INSTANCE_NAME`_REFGEN_DEFAULT_EN_CFG |\
                                                         `$INSTANCE_NAME`_REFGEN_DEFAULT_GAIN_CFG |\
                                                         `$INSTANCE_NAME`_REFGEN_DEFAULT_BYPASS_CFG |\
                                                         `$INSTANCE_NAME`_REFGEN_DEFAULT_RES_EN_CFG)


 /*+--------+---------------+------------------------------------------+---------------------------------------------+
   |        |               |        AUTO_ZERO_EN=TRUE                 |       AUTO_ZERO_EN=FALSE                    |
   +  BITS  +   FIELD       +------------------------------------------+---------------------------------------------+
   |        |               |              MODE                        |             MODE                            |
   |--------|---------------|------------------------------------------|---------------------------------------------|
   |  0     | CSDCMP_EN     | 0x00(CSD comparator is disabled)         | 0x00(CSD comparator is disabled)            |
   |  5:04  | POLARITY_SEL  | 0x00(IDAC_A polarity is used)            | 0x00(IDAC_A polarity is used)               |
   |  9:08  | CMP_PHASE     | 0x03(Comparator activated on both phases)| 0x03(Comparator activated in both phases)   |
   |  28    | CMP_MODE      | 0x00(CSD mode)                           | 0x00(CSD mode)                              |
   |  29    | FEEDBACK_MODE | 0x00(Feedback from sampling flip-flop)   | 0x00(Feedback from sampling flip-flop)      |
   |  31    | AZ_EN         | 0x01(Auto-Zero functionality is enabled) | 0x00(Auto-Zero functionality is disabled)   |
   +--------+---------------+------------------------------------------+---------------------------------------------+ */
#if(0u != `$INSTANCE_NAME`_CSX_AUTO_ZERO_EN)
    #define `$INSTANCE_NAME`_DEFAULT_CSD_CSDCMP_CFG             (0x80000300uL)
#else
    #define `$INSTANCE_NAME`_DEFAULT_CSD_CSDCMP_CFG             (0x00000300uL)
#endif /* (0u != `$INSTANCE_NAME`_CSX_AUTO_ZERO_EN) */

/* +--------+---------------+----------------------------------------------------------------------------------------+
   |  BITS  |   FIELD       |              MODE                                                                      |
   |--------|---------------|----------------------------------------------------------------------------------------|
   | 6:0    | VAL           | 0x00(Set IDAC value to "0")                                                            |
   | 7      | POL_DYN       | 0x01(Set dynamic IDAC polarity)                                                        |
   | 9:8    | POLARITY      | 0x02(IDAC polarity follows CSD_SENSE signal)                                           |
   | 11:10  | BAL_MODE      | 0x03(IDAC is enabled in both phases and disabled by CSDCOMP at the end of balancing)   |
   | 17:16  | LEG1_MODE     | 0x03(Configure LEG1 to CSD dynamic mode)                                               |
   | 19:18  | LEG2_MODE     | 0x00(LEG2 is disabled)                                                                 |
   | 21     | DSI_CTRL_EN   | 0x00(IDAC DSI control is disabled)                                                     |
   | 23:22  | RANGE         | Set range according to Csx0IdacGainV2 parameter value                                  |
   | 24     | LEG1_EN       | 0x01(Output for LEG1 is enabled)                                                       |
   | 25     | LEG2_EN       | 0x00(Output for LEG2 is disabled)                                                      |
   +--------+---------------+----------------------------------------------------------------------------------------+*/
#define `$INSTANCE_NAME`_DEFAULT_CSD_IDACA_CFG                  ((0x01030E80uL) | \
                                                                ((`$INSTANCE_NAME`_CSX_IDAC_GAIN << CSD_IDACA_RANGE_Pos) & \
                                                                  `$INSTANCE_NAME`_CSD_IDACA_RANGE_MSK))

/* +--------+---------------+----------------------------------------------------------------------------------------+
   |  BITS  |   FIELD       |              MODE                                                                      |
   |--------|---------------|----------------------------------------------------------------------------------------|
   | 6:0    | VAL           | 0x00(Set IDAC value to "0")                                                            |
   | 7      | POL_DYN       | 0x00(Set to "0" since IDACB is not used)                                               |
   | 9:8    | POLARITY      | 0x00(Set to "0" since IDACB is not used)                                               |
   | 11:10  | BAL_MODE      | 0x00(Set to "0" since IDACB is not used)                                               |
   | 17:16  | LEG1_MODE     | 0x00(Set to "0" since IDACB is not used)                                               |
   | 19:18  | LEG2_MODE     | 0x00(Set to "0" since IDACB is not used)                                               |
   | 21     | DSI_CTRL_EN   | 0x00(Set to "0" since IDACB is not used)                                               |
   | 23:22  | RANGE         | 0x00(Set to "0" since IDACB is not used)                                               |
   | 24     | LEG1_EN       | 0x00(Output for LEG2 is disabled)                                                      |
   | 25     | LEG2_EN       | 0x00(Output for LEG2 is disabled)                                                      |
   +--------+---------------+----------------------------------------------------------------------------------------+*/
#define `$INSTANCE_NAME`_DEFAULT_CSD_IDACB_CFG                  (0x00000000uL)

/* +--------+---------------+----------------------------------------------------------------------------------------+
   |  BITS  |   FIELD       |              MODE                                                                      |
   +--------+---------------+----------------------------------------------------------------------------------------+
   | 1:0    | RES_HCAV      | 0x00(Configure HCAV switch to LOW resistance)                                          |
   | 3:2    | RES_HCAG      | 0x00(Configure HCAG switch to LOW resistance)                                          |
   | 5:4    | RES_HCBV      | 0x00(Configure HCBV switch to LOW resistance)                                          |
   | 7:6    | RES_HCBG      | 0x00(Configure HCBG switch to LOW resistance)                                          |
   | 17:16  | RES_F1PM      | 0x00(Configure F1PM switch to LOW resistance)                                          |
   | 19:18  | RES_F2PT      | 0x00(Configure 2PT switch to LOW resistance)                                           |
   +--------+---------------+----------------------------------------------------------------------------------------+*/
#define `$INSTANCE_NAME`_DEFAULT_CSD_SW_RES_CFG                 (0x00000000uL)

 /*+--------+---------------+--------------------------------------------+-------------------------------------------+
   |        |               |      TX_CLK_SOURCE=PRSAUTO                 |     TX_CLK_SOURCE!=PRSAUTO                |
   +  BITS  +   FIELD       +--------------------------------------------+-------------------------------------------+
   |        |               |              MODE                          |             MODE                          |
   |--------|---------------|--------------------------------------------|-------------------------------------------|
   |  11:00 | SENSE_DIV     | Set to CSX_TX_CLK_DIVIDER value            | Set to CSX_TX_CLK_DIVIDER value           |
   |  18:16 | LFSR_SIZE     | 0x00(Will be reconfigured in Run Time)     | 0x00(Set to "0" since not used)           |
   |  23:20 | LFSR_SCALE    | 0x00(Will be reconfigured in Run Time)     | Set to CSX_TX_CLK_SOURCE value            |
   |  24    | LFSR_CLEAR    | 0x00(Will be reconfigured in Run Time)     | 0x00(Will be reconfigured in Run Time)    |
   |  25    | SEL_LFSR_MSB  | 0x00(Not used for CSX scanning method)     | 0x00(Not used for CSX scanning method)    |
   |  27:26 | LFSR_BITS     | 0x0C(Use 5 bits. Range=[-16:15])           | 0x0C(Use 5 bits. Range=[-16:15])          |
   +--------+---------------+-----------------------------+----------------------------------------------------------+ */
#if(`$INSTANCE_NAME`_CSX_TX_CLK_SOURCE != `$INSTANCE_NAME`_CLK_SOURCE_PRSAUTO)
    #define `$INSTANCE_NAME`_DEFAULT_CSD_SENSE_PERIOD_CFG       (`$INSTANCE_NAME`_CSD_SENSE_PERIOD_LFSR_BITS_MSK | \
                                                                (uint32)((uint32)`$INSTANCE_NAME`_CSX_TX_CLK_SOURCE << \
                                                                `$INSTANCE_NAME`_CSD_SENSE_PERIOD_LFSR_SIZE_POS) | \
                                                                ((uint32)`$INSTANCE_NAME`_CSX_TX_CLK_DIVIDER & \
                                                                (uint32)`$INSTANCE_NAME`_CSD_SENSE_PERIOD_SENSE_DIV_MSK))
#else
    #define `$INSTANCE_NAME`_DEFAULT_CSD_SENSE_PERIOD_CFG       (`$INSTANCE_NAME`_CSD_SENSE_PERIOD_LFSR_BITS_MSK | \
                                                                (`$INSTANCE_NAME`_CSX_TX_CLK_DIVIDER & \
                                                                `$INSTANCE_NAME`_CSD_SENSE_PERIOD_SENSE_DIV_MSK))
#endif /* (`$INSTANCE_NAME`_CSX_TX_CLK_SOURCE != `$INSTANCE_NAME`_CLK_SOURCE_PRSAUTO) */

/* +--------+---------------+----------------------------------------------------------------------------------------+
   |  BITS  |   FIELD       |              MODE                                                                      |
   |--------|---------------|----------------------------------------------------------------------------------------|
   | 11:0   | SENSE_WIDTH   | 0x0000(Set to "0" SenseClk cycles)                                                     |
   | 16     | SENSE_POL     | 0x00(Start with low phase)                                                             |
   | 18     | OVERLAP_PHI1  | 0x00(Non overlap for Phi1)                                                             |
   | 19     | OVERLAP_PHI2  | 0x00(Non overlap for Phi2)                                                             |
   +--------+---------------+----------------------------------------------------------------------------------------+*/
#define `$INSTANCE_NAME`_DEFAULT_CSD_SENSE_DUTY_CFG             (0x00000000uL)

/* +--------+---------------+----------------------------------------------------------------------------------------+
   |  BITS  |   FIELD       |              MODE                                                                      |
   |--------|---------------|----------------------------------------------------------------------------------------|
   | 0      | SW_HMPM       | 0x00(HMPM switch is statically open)                                                   |
   | 4      | SW_HMPT       | 0x00(HMPT switch is statically open)                                                   |
   | 8      | SW_HMPS       | 0x00(HMPS switch is statically open)                                                   |
   | 12     | SW_HMMA       | 0x00(HMMA switch is statically open)                                                   |
   | 16     | SW_HMMB       | 0x00(HMMB switch is statically open)                                                   |
   | 20     | SW_HMCA       | 0x00(HMCA switch is statically open)                                                   |
   | 24     | SW_HMCB       | 0x00(HMCB switch is statically open)                                                   |
   | 28     | SW_HMRH       | 0x00(HMRH switch is statically open)                                                   |
   +--------+---------------+----------------------------------------------------------------------------------------+*/
#define `$INSTANCE_NAME`_DEFAULT_CSD_SW_HS_P_SEL_CFG            (0x00000000uL)

/* +--------+---------------+----------------------------------------------------------------------------------------+
   |  BITS  |   FIELD       |              MODE                                                                      |
   |--------|---------------|----------------------------------------------------------------------------------------|
   | 16     | SW_HCCC       | 0x00(HCCC switch is statically open)                                                   |
   | 20     | SW_HCCD       | 0x00(HCCD switch is statically open)                                                   |
   | 26:24  | SW_HCRH       | 0x00(HCRH switch is statically open)                                                   |
   | 30:28  | SW_HCRL       | 0x00(HCRL switch is statically open)                                                   |
   +--------+---------------+----------------------------------------------------------------------------------------+*/
#define `$INSTANCE_NAME`_DEFAULT_CSD_SW_HS_N_SEL_CFG            (0x00000000uL)

/* +--------+---------------+----------------------------------------------------------------------------------------+
   |  BITS  |   FIELD       |              MODE                                                                      |
   |--------|---------------|----------------------------------------------------------------------------------------|
   | 2:0    | SW_HCAV       | 0x00(HCAV switch is statically open)                                                   |
   | 6:4    | SW_HCAG       | 0x00(HCAG switch is statically open)                                                   |
   | 10:8   | SW_HCBV       | 0x00(HCBV switch is statically open)                                                   |
   | 14:12  | SW_HCBG       | 0x00(HCBG switch is statically open)                                                   |
   | 16     | SW_HCCV       | 0x00(HCCV switch is statically open)                                                   |
   | 20     | SW_HCCG       | 0x00(HCCG switch is statically open)                                                   |
   +--------+---------------+----------------------------------------------------------------------------------------+*/
#define `$INSTANCE_NAME`_DEFAULT_CSD_SW_SHIELD_SEL_CFG          (0x00000000uL)

