BasileBerckmoes/RobotComp2ELO/Roadster/Software/PSoc/Roadster/RoadsterRACEMODE/CyComponentLibrary.cylib/CapSense_v1_0/API/CapSense_SensingCSX_LL.h
 /*+--------+---------------+--------------------------------------------+-------------------------------------------+
   |        |               |           VDDA >= 2V                       |          VDDA < 2V                        |
   +  BITS  +   FIELD       +--------------------------------------------+-------------------------------------------+
   |        |               |              MODE                          |             MODE                          |
   |--------|---------------|--------------------------------------------|-------------------------------------------|
   |  4     | SW_IRBY       | 0x00(IRBY switch is statically open)       | 0x00(IRBY switch is statically open)      |
   |  8     | SW_IRLB       | 0x00(IRLB switch is statically open)       | 0x01(IRLB switch is statically closed)    |
   |  12    | SW_ICA        | 0x00(ICA  switch is statically open)       | 0x00(ICA  switch is statically open)      |
   |  18:16 | SW_ICB        | 0x00(ICB  switch is statically open)       | 0x00(ICB  switch is statically open)      |
   |  20    | SW_IRLI       | 0x00(IRLI switch is statically open)       | 0x00(IRLI switch is statically open)      |
   |  24    | SW_IRH        | 0x00(IRH  switch is statically open)       | 0x01(IRH  switch is statically closed)    |
   |  28    | SW_IRL        | 0x00(IRL  switch is statically open)       | 0x00(IRL  switch is statically open)      |
   +--------+---------------+--------------------------------------------+-------------------------------------------+*/
#if (`$INSTANCE_NAME`_CYDEV_VDDA_MV >= 2000u)
    #define `$INSTANCE_NAME`_DEFAULT_CSD_SW_AMUXBUF_SEL_CFG     (0x00000000uL)
#else
    #define `$INSTANCE_NAME`_DEFAULT_CSD_SW_AMUXBUF_SEL_CFG     (0x01000100uL)
#endif /* (CYDEV_VDDA_MV >= 2000u) */

/* +--------+---------------+----------------------------------------------------------------------------------------+
   |  BITS  |   FIELD       |              MODE                                                                      |
   |--------|---------------|----------------------------------------------------------------------------------------|
   | 12     | SW_BYA        | 0x01(BYA switch is statically closed)                                                  |
   | 16     | SW_BYB        | 0x00(BYB switch is statically open)                                                    |
   | 20     | SW_CBCC       | 0x00(CBCC switch is statically open)                                                   |
   +--------+---------------+----------------------------------------------------------------------------------------+*/
#define `$INSTANCE_NAME`_DEFAULT_CSD_SW_BYP_SEL_CFG             (0x00000000uL)

/* +--------+---------------+----------------------------------------------------------------------------------------+
   |  BITS  |   FIELD       |              MODE                                                                      |
   |--------|---------------|----------------------------------------------------------------------------------------|
   | 2:0    | SW_SFPM       | 0x03(SFPM switch is controlled by Phi2 of SenseClk signal)                             |
   | 6:4    | SW_SFPT       | 0x02(SFPM switch is controlled by Phi1 of the SenseClk signal)                         |
   | 10:8   | SW_SFPS       | 0x00(SFPS switch is statically open)                                                   |
   | 12     | SW_SFMA       | 0x00(SFMA switch is statically open)                                                   |
   | 16     | SW_SFMB       | 0x00(SFMB switch is statically open)                                                   |
   | 20     | SW_SFCA       | 0x00(SFCA switch is statically open)                                                   |
   | 24     | SW_SFCB       | 0x00(SFCB switch is statically open)                                                   |
   +--------+---------------+----------------------------------------------------------------------------------------+*/
#define `$INSTANCE_NAME`_DEFAULT_CSD_SW_CMP_P_SEL_CFG           (0x00000023uL)

 /*+--------+---------------+--------------------------------------------+-------------------------------------------+
   |        |               |           VDDA >= 2V                       |          VDDA <2V                         |
   +  BITS  +   FIELD       +--------------------------------------------+-------------------------------------------+
   |        |               |              MODE                          |             MODE                          |
   |--------|---------------|--------------------------------------------|-------------------------------------------|
   |  26:24 | SW_SCRH       |  0x01(SFPS switch is statically closed)    | 0x00(SFPS switch is statically open)      |
   |  30:28 | SW_SCRL       |  0x00(SFPS switch is statically open)      | 0x01(SFPS switch is statically closed)    |
   +--------+---------------+--------------------------------------------+-------------------------------------------+ */
#if (`$INSTANCE_NAME`_CYDEV_VDDA_MV >= 2000u)
    #define `$INSTANCE_NAME`_DEFAULT_CSD_SW_CMP_N_SEL_CFG       (0x01000000uL)
#else
    #define `$INSTANCE_NAME`_DEFAULT_CSD_SW_CMP_N_SEL_CFG       (0x10000000uL)
#endif /* (CYDEV_VDDA_MV >= 2000u) */


/* +--------+---------------+--------------------------------------------+-------------------------------------------+
   |        |               |             VREF_SRC=SRSS                  |              VREF_SRC=PASS                |
   +  BITS  +   FIELD       +--------------------------------------------+-------------------------------------------+
   |        |               |              MODE                          |              MODE                         |
   |--------|---------------|--------------------------------------------|-------------------------------------------|
   |  0     | SW_IAIB       | 0x00(IAIB switch is statically open)       | 0x00(IAIB switch is statically open)      |
   |  4     | SW_IBCB       | 0x00(IBCB switch is statically open)       | 0x00(IBCB switch is statically open)      |
   |  16    | SW_SGMB       | 0x00(SGMB switch is statically open)       | 0x00(SGMB switch is statically open)      |
   |  20    | SW_SGRP       | 0x00(SGRP switch is statically open)       | 0x01(SGRP switch is statically closed)    |
   |  24    | SW_SGRE       | 0x00(SGRE switch is statically open)       | 0x00(SGRE switch is statically open)      |
   |  28    | SW_SGR        | 0x01(SGR switch is statically closed)      | 0x00(SGR switch is statically open)       |
   +--------+---------------+--------------------------------------------+-------------------------------------------+ */
#if(`$INSTANCE_NAME`_VREF_SRSS != `$INSTANCE_NAME`_CSD_VREF_SOURCE)
    #define `$INSTANCE_NAME`_DEFAULT_CSD_SW_REFGEN_SEL_CFG          (0x00100000uL)
#else
    #define `$INSTANCE_NAME`_DEFAULT_CSD_SW_REFGEN_SEL_CFG          (0x10000000uL)
#endif /* (`$INSTANCE_NAME`_VREF_SRSS != `$INSTANCE_NAME`_CSD_VREF_SOURCE) */

#define `$INSTANCE_NAME`_DEFAULT_CSD_SW_REFGEN_SEL_MSK              (0x10100000uL)
/* +--------+---------------+----------------------------------------------------------------------------------------+
   |  BITS  |   FIELD       |              MODE                                                                      |
   |--------|---------------|----------------------------------------------------------------------------------------|
   | 0      | SW_F1PM       | 0x00(F1PM switch is statically open)                                                   |
   | 10:8   | SW_F1MA       | 0x00(F1MA switch is statically open)                                                   |
   | 18:16  | SW_F1CA       | 0x00(F1CA switch is statically open)                                                   |
   | 20     | SW_C1CC       | 0x00(C1CC switch is statically open)                                                   |
   | 24     | SW_C1CD       | 0x00(C1CD switch is statically open)                                                   |
   | 28     | SW_C1F1       | 0x00(C1F1 switch is statically open)                                                   |
   +--------+---------------+----------------------------------------------------------------------------------------+*/
#define `$INSTANCE_NAME`_DEFAULT_CSD_SW_FW_MOD_SEL_CFG          (0x00030301uL)

/* +--------+---------------+----------------------------------------------------------------------------------------+
   |  BITS  |   FIELD       |              MODE                                                                      |
   |--------|---------------|----------------------------------------------------------------------------------------|
   | 4      | SW_F2PT       | 0x00(F2PT switch is statically open)                                                   |
   | 10:8   | SW_F2MA       | 0x00(F2MA switch is statically open)                                                   |
   | 14:12  | SW_F2CA       | 0x00(F2CA switch is statically open)                                                   |
   | 18:16  | SW_F2CB       | 0x00(F2CB switch is statically open)                                                   |
   | 20     | SW_C2CC       | 0x00(C2CC switch is statically open)                                                   |
   | 24     | SW_C2CD       | 0x00(C2CD switch is statically open)                                                   |
   | 28     | SW_C2F2       | 0x00(C2F2 switch is statically open)                                                   |
   +--------+---------------+----------------------------------------------------------------------------------------+*/
#define `$INSTANCE_NAME`_DEFAULT_CSD_SW_FW_TANK_SEL_CFG         (0x00002210uL)

/* +--------+---------------+----------------------------------------------------------------------------------------+
   |  BITS  |   FIELD       |              MODE                                                                      |
   |--------|---------------|----------------------------------------------------------------------------------------|
   | 2:0    | DSI_CSH_TANK  | 0x00(DSI_CSH_TANK switch is statically open)                                           |
   | 6:4    | DSI_CMOD      | 0x00(DSI_CMOD switch is statically open)                                               |
   +--------+---------------+----------------------------------------------------------------------------------------+*/
#define `$INSTANCE_NAME`_DEFAULT_CSD_SW_DSI_SEL_CFG             (0x00000000uL)

/* +--------+---------------+----------------------------------------------------------------------------------------+
   |  BITS  |   FIELD       |              MODE                                                                      |
   |--------|---------------|----------------------------------------------------------------------------------------|
   | 3:0    | TX_OUT        | 0x00(The TX_OUT signal is set to the static "0")                                       |
   | 7:4    | TX_OUT_EN     | 0x00(The TX_OUT_EN signal is set to the static "0")                                    |
   | 15:12  | TX_AMUXB_EN   | 0x00(The TX_AMUXB_EN signal is set to the static "0")                                  |
   | 19:16  | TX_N_OUT      | 0x00(The TX_N_OUT signal is set to the static "0")                                     |
   | 23:20  | TX_N_OUT_EN   | 0x00(The TX_N_OUT_EN signal is set to the static "0")                                  |
   | 27:24  | TX_N_AMUXA_EN | 0x00(The TX_N_AMUXA_EN signal is set to the static "0")                                |
   +--------+---------------+----------------------------------------------------------------------------------------+*/
#define `$INSTANCE_NAME`_DEFAULT_CSD_SW_IO_SEL_CFG             (0x0000001FuL)

/* +--------+---------------+----------------------------------------------------------------------------------------+
   |  BITS  |   FIELD       |              MODE                                                                      |
   |--------|---------------|----------------------------------------------------------------------------------------|
   | 7:0    | AZ_TIME       | Set to AUTO_ZERO_TIME value                                                            |
   +--------+---------------+----------------------------------------------------------------------------------------+*/
#define `$INSTANCE_NAME`_DEFAULT_CSD_SEQ_TIME_CFG               (`$INSTANCE_NAME`_CSX_AUTO_ZERO_TIME & \
                                                                 `$INSTANCE_NAME`_CSD_SEQ_INIT_CNT_CONV_CNT_MSK)

/* +--------+---------------+----------------------------------------------------------------------------------------+
   |  BITS  |   FIELD       |              MODE                                                                      |
   |--------|---------------|----------------------------------------------------------------------------------------|
   | 15:0   | CONV_CNT      | 0x0014(Set coarse initialization time to 20 SenseClk periods)                          |
   +--------+---------------+----------------------------------------------------------------------------------------+*/
#define `$INSTANCE_NAME`_DEFAULT_CSD_SEQ_INIT_CNT_CFG           (`$INSTANCE_NAME`_CSX_FINE_INIT_TIME)

/* +--------+---------------+----------------------------------------------------------------------------------------+
   |  BITS  |   FIELD       |              MODE                                                                      |
   |--------|---------------|----------------------------------------------------------------------------------------|
   | 15:0   | CONV_CNT      | 0x0000(Sets the number of conversions per sample to "0")                               |
   +--------+---------------+----------------------------------------------------------------------------------------+*/
#define `$INSTANCE_NAME`_DEFAULT_CSD_SEQ_NORM_CNT_CFG           (0x00000000uL)

/* +--------+---------------+----------------------------------------------------------------------------------------+
   |  BITS  |   FIELD       |              MODE                                                                      |
   |--------|---------------|----------------------------------------------------------------------------------------|
   | 7:0    | ADC_TIME      | 0x00(Set to "0" since ADC is not used)                                                 |
   | 17:16  | ADC_MODE      | 0b00(Set to "0" since ADC is not used)                                                 |
   +--------+---------------+----------------------------------------------------------------------------------------+*/
#define `$INSTANCE_NAME`_DEFAULT_CSD_ADC_CTL_CFG                (0x00000000uL)

 /*+--------+---------------+--------------------------------------------+--------------------------------------------+
   |        |               |      AUTO_ZERO_EN=TRUE                     |     AUTO_ZERO_EN=TRUE                      |
   +  BITS  +   FIELD       +--------------------------------------------+--------------------------------------------+
   |        |               |              MODE                          |             MODE                           |
   |--------|---------------|--------------------------------------------|--------------------------------------------|
   |  0     | START         | 0x00(CSD sequencer is stopped)             | 0x00(CSD sequencer is stopped)             |
   |  1     | SEQ_MODE      | 0x00(Regular scan mode is used)            | 0x00(Regular scan mode is used)            |
   |  3     | ABORT         | 0x01(Reset CSD sequencer to IDLE state)    | 0x01(Reset CSD sequencer to IDLE state)    |
   |  4     | DSI_START_EN  | 0x00(Disable control by DSI)               | 0x00(Disable control by DSI)               |
   |  8     | AZ0_SKIP      | 0x00(Do not skip AZ0 state)                | 0x01(Skip AZ0 state)                       |
   |  9     | AZ1_SKIP      | 0x00(Do not skip AZ1 state)                | 0x01(Skip AZ1 state)                       |
   +--------+---------------+--------------------------------------------+--------------------------------------------+ */
#if(`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSX_AUTO_ZERO_EN)
    #define `$INSTANCE_NAME`_DEFAULT_CSD_SEQ_START_CFG          (0x00000008uL)
#else
    #define `$INSTANCE_NAME`_DEFAULT_CSD_SEQ_START_CFG          (0x00000308uL)
#endif /* (0u != `$INSTANCE_NAME`_CSX_AUTO_ZERO_EN) */

/* +--------+---------------+----------------------------------------------------------------------------------------+
   |  BITS  |   FIELD       |              MODE                                                                      |
   |--------|---------------|----------------------------------------------------------------------------------------|
   |  0     | IREF_SEL      | 0x00(Select SRSS Iref)                                                                 |
   |  8:4   | FILTER_DELAY  | 0x00(Will be reconfigured in Run Time)                                                 |
   |  11:10 | SHIELD_DELAY  | 0x00(Delay Line is OFF)                                                                |
   |  12    | SENSE_EN      | 0x01(Enabled. Switches can be closed)                                                  |
   |  17    | FULL_WAVE     | 0x00(Half Wave Mode)                                                                   |
   |  18    | MUTUAL_CAP    | 0x01(Mutual-cap mode)                                                                  |
   |  19    | CSX_DUAL_CNT  | 0x01(Use two counters)                                                                 |
   |  24    | DSI_COUNT_SEL | 0x00(CSD-Result on DSI_COUNT bus)                                                      |
   |  25    | DSI_SAMPLE_EN | 0x00(DSI_SAMPLE_IN is disabled)                                                        |
   |  26    | SAMPLE_SYNC   | 0x00(Double sync is disabled)                                                          |
   |  27    | DSI_SENSE_EN  | 0x00(DSI_SENSE_IN is disabled)                                                         |
   |  30    | LP_MODE       | 0x00(High power mode)                                                                  |
   |  31    | ENABLE        | 0x01(Analog part is ON)                                                                |
   +--------+---------------+----------------------------------------------------------------------------------------+*/

#if(`$INSTANCE_NAME`_IREF_SRSS != `$INSTANCE_NAME`_CSD_IREF_SOURCE)
    #define `$INSTANCE_NAME`_CONFIG_PRESCAN_IREF_CFG         (0x00000001uL)
#else
    #define `$INSTANCE_NAME`_CONFIG_PRESCAN_IREF_CFG         (0x00000000uL)
#endif /* (`$INSTANCE_NAME`_IREF_SRSS != `$INSTANCE_NAME`_CSD_IREF_SOURCE) */

#if(`$INSTANCE_NAME`_DISABLE != `$INSTANCE_NAME`_LP_MODE_EN)
    #define `$INSTANCE_NAME`_CONFIG_PRESCAN_LP_MODE_CFG      (0x40000000uL)
#else
    #define `$INSTANCE_NAME`_CONFIG_PRESCAN_LP_MODE_CFG      (0x00000000uL)
#endif /* (`$INSTANCE_NAME`_DISABLE != `$INSTANCE_NAME`_LP_MODE_EN) */

