BasileBerckmoes/RobotComp2ELO/Roadster/Software/PSoc/Roadster/RoadsterRACEMODE/CyComponentLibrary.cylib/CapSense_v1_0/API/CapSense_SensingCSX_LL.h
#define `$INSTANCE_NAME`_CONFIG_PRESCAN_EN_CFG               (0x80000000uL)
#define `$INSTANCE_NAME`_CONFIG_PRESCAN_SENSE_EN_CFG         (0x00001000uL)
#define `$INSTANCE_NAME`_CONFIG_PRESCAN_FILTER_DELAY_CFG     (0x00000000uL)
#define `$INSTANCE_NAME`_CONFIG_PRESCAN_MUTUAL_CFG           (0x00040000uL)
#define `$INSTANCE_NAME`_CONFIG_PRESCAN_DUAL_CNT_CFG         (0x00080000uL)


#define `$INSTANCE_NAME`_PRESCAN_CSD_CONFIG_CFG       (`$INSTANCE_NAME`_CONFIG_PRESCAN_IREF_CFG |\
                                                       `$INSTANCE_NAME`_CONFIG_PRESCAN_FILTER_DELAY_CFG |\
                                                       `$INSTANCE_NAME`_CONFIG_PRESCAN_SENSE_EN_CFG |\
                                                       `$INSTANCE_NAME`_CONFIG_PRESCAN_MUTUAL_CFG |\
                                                       `$INSTANCE_NAME`_CONFIG_PRESCAN_DUAL_CNT_CFG |\
                                                       `$INSTANCE_NAME`_CONFIG_PRESCAN_LP_MODE_CFG |\
                                                       `$INSTANCE_NAME`_CONFIG_PRESCAN_EN_CFG)

 /*+--------+---------------+--------------------------------------------+-------------------------------------------+
   |        |               |    AUTO_ZERO_EN=TRUE                       |    AUTO_ZERO_EN=FALSE                     |
   +  BITS  +   FIELD       +--------------------------------------------+-------------------------------------------+
   |        |               |              MODE                          |             MODE                          |
   |--------|---------------|--------------------------------------------|-------------------------------------------|
   |  0     | CSDCMP_EN     | 0x01(CSD comparator is Enabled)            | 0x01(CSD comparator is Eisabled)          |
   |  5:4   | POLARITY_SEL  | 0x00(IDAC_A polarity is used)              | 0x00(IDAC_A polarity is used)             |
   |  9:8   | CMP_PHASE     | 0x03(Comparator activated in both phases)  | 0x03(Comparator activated in both phases) |
   |  28    | CMP_MODE      | 0x00(CSD mode)                             | 0x00(CSD mode)                            |
   |  29    | FEEDBACK_MODE | 0x00(Feedback from sampling flip-flop)     | 0x00(Feedback from sampling flip-flop)    |
   |  31    | AZ_EN         | 0x01(Auto-Zero functionality is enabled)   | 0x00(Auto-Zero functionality is disabled) |
   +--------+---------------+--------------------------------------------+-------------------------------------------+ */
#if(`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSX_AUTO_ZERO_EN)
    #define `$INSTANCE_NAME`_PRESCAN_CSD_CSDCMP_CFG             (0x80000301uL)
#else
    #define `$INSTANCE_NAME`_PRESCAN_CSD_CSDCMP_CFG             (0x00000301uL)
#endif /* (0u != `$INSTANCE_NAME`_CSX_AUTO_ZERO_EN) */

/* +--------+---------------+----------------------------------------------------------------------------------------+
   |  BITS  |   FIELD       |              MODE                                                                      |
   |--------|---------------|----------------------------------------------------------------------------------------|
   |  0     |  HSCMP_EN     | 0x01(High Speed comparator is Enabled)                                                 |
   |  4     |  HSCMP_INVERT | 0x00(High Speed comparator output is not inverted)                                     |
   |  31    |  AZ_EN        | 0x00(Auto-Zero is Disabled)                                                            |
   +--------+---------------+----------------------------------------------------------------------------------------+*/
#define `$INSTANCE_NAME`_PRECHARGE_CSD_HSCMP_CFG                (0x00000001uL)

/* +--------+---------------+----------------------------------------------------------------------------------------+
   |  BITS  |   FIELD       |              MODE                                                                      |
   |--------|---------------|----------------------------------------------------------------------------------------|
   | 0      | SW_HMPM       | 0x01(HMPM switch is statically closed)                                                 |
   | 4      | SW_HMPT       | 0x01(HMPT switch is statically closed)                                                 |
   | 8      | SW_HMPS       | 0x00(HMPS switch is statically open)                                                   |
   | 12     | SW_HMMA       | 0x00(HMMA switch is statically open)                                                   |
   | 16     | SW_HMMB       | 0x00(HMMB switch is statically open)                                                   |
   | 20     | SW_HMCA       | 0x00(HMCA switch is statically open)                                                   |
   | 24     | SW_HMCB       | 0x00(HMCB switch is statically open)                                                   |
   | 28     | SW_HMRH       | 0x00(HMRH switch is statically open)                                                   |
   +--------+---------------+----------------------------------------------------------------------------------------+*/
#define `$INSTANCE_NAME`_PRECHARGE_CSD_SW_HS_P_SEL_CFG          (0x00000011uL)

/* +--------+---------------+----------------------------------------------------------------------------------------+
   |  BITS  |   FIELD       |              MODE                                                                      |
   |--------|---------------|----------------------------------------------------------------------------------------|
   | 16     | SW_HCCC       | 0x00(HCCC switch is statically open)                                                   |
   | 20     | SW_HCCD       | 0x00(HCCD switch is statically open)                                                   |
   | 26:24  | SW_HCRH       | 0x01(HCRH switch is statically closed)                                                 |
   | 30:28  | SW_HCRL       | 0x00(HCRL switch is statically open)                                                   |
   +--------+---------------+----------------------------------------------------------------------------------------+*/
#if (`$INSTANCE_NAME`_CYDEV_VDDA_MV >= 2000u)
    #define `$INSTANCE_NAME`_PRECHARGE_CSD_SW_HS_N_SEL_CFG          (0x01000000uL)
#else
    #define `$INSTANCE_NAME`_PRECHARGE_CSD_SW_HS_N_SEL_CFG          (0x10000000uL)
#endif /*  */

/* +--------+---------------+----------------------------------------------------------------------------------------+
   |  BITS  |   FIELD       |              MODE                                                                      |
   |--------|---------------|----------------------------------------------------------------------------------------|
   | 2:0    | DSI_CSH_TANK  | 0x00(DSI_CSH_TANK switch is statically open)                                           |
   | 6:4    | DSI_CMOD      | 0x00(DSI_CMOD switch is statically open)                                               |
   +--------+---------------+----------------------------------------------------------------------------------------+*/
#define `$INSTANCE_NAME`_PRECHARGE_CSD_SW_DSI_SEL_CFG           (0x00000000uL)

/* +--------+---------------+----------------------------------------------------------------------------------------+
   |  BITS  |   FIELD       |              MODE                                                                      |
   |--------|---------------|----------------------------------------------------------------------------------------|
   | 2:0    | SW_HCAV       | 0x06(HCAV switch is controlled by HSCMP output)                                        |
   | 6:4    | SW_HCAG       | 0x00(HCAG switch is statically open)                                                   |
   | 10:8   | SW_HCBV       | 0x00(HCBV switch is statically open)                                                   |
   | 14:12  | SW_HCBG       | 0x00(HCBG switch is statically open)                                                   |
   | 16     | SW_HCCV       | 0x00(HCCV switch is statically open)                                                   |
   | 20     | SW_HCCG       | 0x00(HCCG switch is statically open)                                                   |
   +--------+---------------+----------------------------------------------------------------------------------------+*/
#define `$INSTANCE_NAME`_PRECHARGE_CSD_SW_SHIELD_SEL_CFG        (0x00000006uL)

/* +--------+---------------+----------------------------------------------------------------------------------------+
   |  BITS  |   FIELD       |              MODE                                                                      |
   |--------|---------------|----------------------------------------------------------------------------------------|
   | 0      | SW_F1PM       | 0x00(F1PM switch is statically closed)                                                 |
   | 10:8   | SW_F1MA       | 0x00(F1MA switch is statically closed)                                                 |
   | 18:16  | SW_F1CA       | 0x00(F1CA switch is statically closed)                                                 |
   | 20     | SW_C1CC       | 0x00(C1CC switch is statically open)                                                   |
   | 24     | SW_C1CD       | 0x00(C1CD switch is statically open)                                                   |
   | 28     | SW_C1F1       | 0x00(C1F1 switch is statically open)                                                   |
   +--------+---------------+----------------------------------------------------------------------------------------+*/
#define `$INSTANCE_NAME`_PRECHARGE_CSD_SW_FW_MOD_SEL_CFG        (0x00010101uL)

/* +--------+---------------+----------------------------------------------------------------------------------------+
   |  BITS  |   FIELD       |              MODE                                                                      |
   |--------|---------------|----------------------------------------------------------------------------------------|
   | 4      | SW_F2PT       | 0x00(F2PT switch is statically closed)                                                 |
   | 10:8   | SW_F2MA       | 0x00(F2MA switch is statically closed)                                                 |
   | 14:12  | SW_F2CA       | 0x00(F2CA switch is statically olosed)                                                 |
   | 18:16  | SW_F2CB       | 0x00(F2CB switch is statically open)                                                   |
   | 20     | SW_C2CC       | 0x00(C2CC switch is statically open)                                                   |
   | 24     | SW_C2CD       | 0x00(C2CD switch is statically open)                                                   |
   | 28     | SW_C2F2       | 0x00(C2F2 switch is statically open)                                                   |
   +--------+---------------+----------------------------------------------------------------------------------------+*/
#define `$INSTANCE_NAME`_PRECHARGE_CSD_SW_FW_TANK_SEL_CFG       (0x00001110uL)

/* +--------+---------------+----------------------------------------------------------------------------------------+
   |  BITS  |   FIELD       |              MODE                                                                      |
   |--------|---------------|----------------------------------------------------------------------------------------|
   | 0      | START         | 0x01(STARTED)                                                                          |
   | 1      | SEQ_MODE      | 0x01(INIT_COARSE)                                                                      |
   | 3      | ABORT         | 0x00(RESET_TO_IDLE_STATE)                                                              |
   | 4      | DSI_START_EN  | 0x00(DISABLE_CONTROL_BY_DSI)                                                           |
   | 8      | AZ0_SKIP      | 0x00(DO_NOT_SKIP_AZ0)                                                                  |
   | 9      | AZ1_SKIP      | 0x00(DO_BOT_SKIP_AZ1)                                                                  |
   +--------+---------------+----------------------------------------------------------------------------------------+*/
#define `$INSTANCE_NAME`_PRECHARGE_CSD_SEQ_START_CFG            (0x00000303uL)

/* +--------+---------------+----------------------------------------------------------------------------------------+
   |  BITS  |   FIELD       |              MODE                                                                      |
   |--------|---------------|----------------------------------------------------------------------------------------|
   | 0      | SW_F1PM       | 0x01(F1PM switch is statically closed)                                                 |
   | 10:8   | SW_F1MA       | 0x03(F1MA switch is controlled by PHI2_DELAY)                                          |
   | 18:16  | SW_F1CA       | 0x03(F1CA switch is controlled by PHI2_DELAY)                                          |
   | 20     | SW_C1CC       | 0x00(C1CC switch is statically open)                                                   |
   | 24     | SW_C1CD       | 0x00(C1CD switch is statically open)                                                   |
   | 28     | SW_C1F1       | 0x00(C1F1 switch is statically open)                                                   |
   +--------+---------------+----------------------------------------------------------------------------------------+*/
#define `$INSTANCE_NAME`_SCAN_CSD_SW_FW_MOD_SEL_CFG             (0x00030301uL)

/* +--------+---------------+----------------------------------------------------------------------------------------+
   |  BITS  |   FIELD       |              MODE                                                                      |
   |--------|---------------|----------------------------------------------------------------------------------------|
   | 4      | SW_F2PT       | 0x01(F2PT switch is statically closed)                                                 |
   | 10:8   | SW_F2MA       | 0x02(F2MA switch is controlled by PHI1_DELAY)                                          |
   | 14:12  | SW_F2CA       | 0x02(F2CA switch is controlled by PHI1_DELAY)                                          |
   | 18:16  | SW_F2CB       | 0x00(F2CB switch is statically open)                                                   |
   | 20     | SW_C2CC       | 0x00(C2CC switch is statically open)                                                   |
   | 24     | SW_C2CD       | 0x00(C2CD switch is statically open)                                                   |
   | 28     | SW_C2F2       | 0x00(C2F2 switch is statically open)                                                   |
   +--------+---------------+----------------------------------------------------------------------------------------+*/
#define `$INSTANCE_NAME`_SCAN_CSD_SW_FW_TANK_SEL_CFG            (0x00002210uL)

/* +--------+---------------+----------------------------------------------------------------------------------------+
   |  BITS  |   FIELD       |              MODE                                                                      |
   |--------|---------------|----------------------------------------------------------------------------------------|
   | 3:0    | TX_OUT        | 0x0F(The Sense waveform is selected for the TX_OUT signal)                             |
   | 7:4    | TX_OUT_EN     | 0x00(The TX_OUT_EN signal is set to the static "0")                                    |
   | 15:12  | TX_AMUXB_EN   | 0x00(The TX_AMUXB_EN signal is set to the static "0")                                  |
   | 19:16  | TX_N_OUT      | 0x00(The !Sense waveform is selected for the TX_N_OUT signal)                          |
   | 23:20  | TX_N_OUT_EN   | 0x00(The TX_N_OUT_EN signal is set to the static "1")                                  |
   | 27:24  | TX_N_AMUXA_EN | 0x00(The TX_N_AMUXA_EN signal is set to the static "0")                                |
   +--------+---------------+----------------------------------------------------------------------------------------+*/
#define `$INSTANCE_NAME`_SCAN_CSD_SW_IO_SEL_CFG                 (0x0000001FuL)

 /*+--------+---------------+--------------------------------------------+--------------------------------------------+
   |        |               |      AUTO_ZERO_EN=TRUE                     |     AUTO_ZERO_EN=TRUE                      |
   +  BITS  +   FIELD       +--------------------------------------------+--------------------------------------------+
   |        |               |              MODE                          |             MODE                           |
   |--------|---------------|--------------------------------------------|--------------------------------------------|
   |  0     | START         | 0x01(CSD sequencer is stopped)             | 0x01(CSD sequencer is stopped)             |
   |  1     | SEQ_MODE      | 0x00(Regular CSD scan mode is used)        | 0x00(Regular CSD scan mode is used)        |
   |  3     | ABORT         | 0x00(Do not reset CSD sequencer)           | 0x00(Do not reset CSD sequencer)           |
   |  4     | DSI_START_EN  | 0x00(Disable control by DSI)               | 0x00(Disable control by DSI)               |
   |  8     | AZ0_SKIP      | 0x00(Do not skip AZ0 state)                | 0x01(Skip AZ0 state)                       |
   |  9     | AZ1_SKIP      | 0x00(Do not skip AZ1 state)                | 0x01(Skip AZ1 state)                       |
   +--------+---------------+--------------------------------------------+--------------------------------------------+ */
#if(0u != `$INSTANCE_NAME`_CSX_AUTO_ZERO_EN)
    #define `$INSTANCE_NAME`_SCAN_CSD_SEQ_START_CFG             (0x00000001uL)
#else
    #define `$INSTANCE_NAME`_SCAN_CSD_SEQ_START_CFG             (0x00000301uL)
#endif /* (0u != `$INSTANCE_NAME`_CSX_AUTO_ZERO_EN)  */

