BasileBerckmoes/RobotComp2ELO/Roadster/Software/PSoc/Roadster/RoadsterRACEMODE/CyComponentLibrary.cylib/CapSense_v1_0/API/CapSense_SensingCSX_LL.h
/***************************************
* API Constants
***************************************/

#define `$INSTANCE_NAME`_CSX_DEADBAND_CYCLES_NUMBER             (2u)

/* The definition of the time interval is long enough for charging a 100-nF capacitor */
#define `$INSTANCE_NAME`_CSX_MAX_CHARGE_TIME_US                 (100u)
#define `$INSTANCE_NAME`_CSX_AVG_CYCLES_PER_LOOP                (5u)
#define `$INSTANCE_NAME`_CSX_PRECHARGE_WATCHDOG_CYCLES_NUM      (((`$INSTANCE_NAME`_CPU_CLOCK_FREQ_MHZ) * (`$INSTANCE_NAME`_CSX_MAX_CHARGE_TIME_US)) /\
                                                                (`$INSTANCE_NAME`_CSX_AVG_CYCLES_PER_LOOP))

/*******************************************************************************
* Global variables exposed by the module
*******************************************************************************/

/*  The local variable used to store a scan period */
extern volatile uint16 `$INSTANCE_NAME`_csxScanPeriod;

/*  The local variable used to return raw count from post scan ISR */
extern volatile uint16 `$INSTANCE_NAME`_csxRawCount;

extern volatile uint32 `$INSTANCE_NAME`_resamplingCyclesCnt;

/*  The pointer to the function used to register a callback in ISR */
extern void (* `$INSTANCE_NAME`_CSXPostScanApiPtr)(void);

/*******************************************************************************
* Function Prototypes
*******************************************************************************/

/**
* \if SECTION_CAPSENSE_LOW_LEVEL
* \addtogroup group_capsense_low_level
* \{
*/

void `$INSTANCE_NAME`_CSXSetupWidget(uint32 widgetId);
void `$INSTANCE_NAME`_CSXSetupWidgetExt(uint32 widgetId, uint32 sensorId);
void `$INSTANCE_NAME`_CSXScan (void);
void `$INSTANCE_NAME`_CSXScanExt (void);

#if (`$INSTANCE_NAME`_CSX_IDAC_AUTOCAL_EN == `$INSTANCE_NAME`_ENABLE)
    void `$INSTANCE_NAME`_CSXCalibrateWidget(uint32 widgetId, uint16 target);
#endif /* (`$INSTANCE_NAME`_CSX_IDAC_AUTOCAL_EN == `$INSTANCE_NAME`_ENABLE) */

void `$INSTANCE_NAME`_CSXConnectTx(`$INSTANCE_NAME`_FLASH_IO_STRUCT const *txPtr);
void `$INSTANCE_NAME`_CSXConnectRx(`$INSTANCE_NAME`_FLASH_IO_STRUCT const *rxPtr);
void `$INSTANCE_NAME`_CSXDisconnectTx(`$INSTANCE_NAME`_FLASH_IO_STRUCT const *txPtr);
void `$INSTANCE_NAME`_CSXDisconnectRx(`$INSTANCE_NAME`_FLASH_IO_STRUCT const *rxPtr);

/** \}
* \endif */

/*******************************************************************************
* External APIs required by the module
*******************************************************************************/
/* The ISR for the CSX sensing module      */
void `$INSTANCE_NAME`_CSXScanISR(void);

/*******************************************************************************
* Function Prototypes
*******************************************************************************/
/**
* \if SECTION_CAPSENSE_INTERNAL
* \addtogroup group_capsense_internal
* \{
*/

void `$INSTANCE_NAME`_CSXInitialize(void);
void `$INSTANCE_NAME`_CSXElectrodeCheck(void);
uint32 `$INSTANCE_NAME`_SsCSXGetTxClkDivider(uint32 widgetId);

/** \}
* \endif */

#endif  /*  End of `$INSTANCE_NAME`_CSX_EN              */
#endif  /*  End of `$INSTANCE_NAME`_SENSING_CSD_LL_H    */


/* [] END OF FILE */
